//terms of use

export const TermsOfUse = () => {
  return (
    <>
      <div className="mt-5">
        <h1 className="text-2xl text-center mb-2.5">
          Умови користування застосунком.
        </h1>
        <p className="mb-2">
          Ласкаво просимо до нашого застосунку! <br />
          Перед використанням будь ласка уважно ознайомтесь з цими умовами.
        </p>
        <ul>
          <ol className="mb-2">
            1. Збір та використання даних.
            <br />
            Для забезпечення роботи застосунку ми збираємо наступну інформацію:{" "}
            <br />
            <span>
              - Вашу електронну адресу (email) для авторизації та зв’язку.
            </span>{" "}
            <br />
            <span>
              - Ваш нікнейм, який використовується для ідентифікації у
              застосунку.
            </span>
            <br />
            <span>
              - Інформацію про інтерв’ю, яку ви створюєте та зберігаєте у
              застосунку.
            </span>
            <br />
            <span>
              Ми використовуємо ці дані лише для роботи застосунку, зокрема:
            </span>
            <br />
            <span>- Для збереження та відображення ваших інтерв’ю.</span>
            <br />
            <span>
              - Для автентифікації та персоналізації досвіду користування.
            </span>
          </ol>
          <ol className="mb-2">
            2. Конфіденційність <br />
            <span>
              Ваші дані зберігаються у захищеному середовищі (Firebase
              Firestore) і не передаються третім особам без вашої згоди, окрім
              випадків, передбачених законодавством.
            </span>
          </ol>
          <ol className="mb-2">
            3. Ваші права <br />
            Ви маєте право: <br />
            <span>- Оновлювати та видаляти свої дані у застосунку.</span>
            <span>
              {" "}
              - Вимагати видалення вашого акаунту та пов’язаної інформації.
            </span>
            <br />
            <span>- Отримувати інформацію про те, які дані ми зберігаємо.</span>
            <br />
          </ol>
          <ol className="mb-2">
            4. Обмеження відповідальності <br />
            <span>
              Застосунок надається "як є". Ми не несемо відповідальності за
              можливі втрати даних чи інші збитки, пов’язані з використанням
              застосунку.
            </span>{" "}
            <br />
          </ol>
          <ol className="mb-2">
            5. Зміни в умовах <br />
            <span>
              Ми залишаємо за собою право змінювати ці умови. Про зміни буде
              повідомлено у застосунку або електронною поштою.
            </span>{" "}
            <br />
          </ol>
          <ol className="mb-2">
            6. Контактна інформація <br />
            <span>
              Якщо у вас є питання або пропозиції щодо умов користування або
              захисту даних, будь ласка, зв’яжіться з нами за адресою:
              1inboxna@gmail.com
            </span>{" "}
            <br />
          </ol>
        </ul>
      </div>
    </>
  );
};
